; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image3 - mode
	image1 - mode
	thermograph2 - mode
	spectrograph0 - mode
	Star4 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 spectrograph0)
	(supports instrument2 image3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument5 image1)
	(supports instrument5 image3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star16)
	(supports instrument6 image3)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star3)
	(supports instrument7 image3)
	(calibration_target instrument7 Star3)
	(supports instrument8 spectrograph0)
	(supports instrument8 thermograph2)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon10)
)
(:goal (and
	(pointing satellite2 Phenomenon15)
	(have_image Phenomenon5 image3)
	(have_image Star6 image3)
	(have_image Star7 image3)
	(have_image Planet8 image3)
	(have_image Star9 thermograph2)
	(have_image Phenomenon10 image3)
	(have_image Star11 thermograph2)
	(have_image Phenomenon12 image1)
	(have_image Star14 thermograph2)
	(have_image Phenomenon15 thermograph2)
	(have_image Star16 thermograph2)
	(have_image Star17 spectrograph0)
	(have_image Planet18 image3)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 14
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 14
3. (turn_to satellite4 star3 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star3)
   goals met: 0 of 14
4. (calibrate satellite4 instrument6 star3)
   added: (calibrated instrument6)
   goals met: 0 of 14
5. (turn_to satellite4 phenomenon10 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 14
6. (take_image satellite4 phenomenon10 instrument6 image3)
   added: (have_image phenomenon10 image3)
   goals met: 1 of 14
7. (turn_to satellite4 phenomenon5 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon5)
   goals met: 1 of 14
8. (take_image satellite4 phenomenon5 instrument6 image3)
   added: (have_image phenomenon5 image3)
   goals met: 2 of 14
9. (turn_to satellite4 planet18 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 planet18)
   goals met: 2 of 14
10. (take_image satellite4 planet18 instrument6 image3)
   added: (have_image planet18 image3)
   goals met: 3 of 14
11. (turn_to satellite4 planet8 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 planet8)
   goals met: 3 of 14
12. (take_image satellite4 planet8 instrument6 image3)
   added: (have_image planet8 image3)
   goals met: 4 of 14
13. (turn_to satellite4 star17 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star17)
   goals met: 4 of 14
14. (take_image satellite4 star17 instrument6 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 5 of 14
15. (turn_to satellite4 star6 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star6)
   goals met: 5 of 14
16. (take_image satellite4 star6 instrument6 image3)
   added: (have_image star6 image3)
   goals met: 6 of 14
17. (turn_to satellite4 star7 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star7)
   goals met: 6 of 14
18. (take_image satellite4 star7 instrument6 image3)
   added: (have_image star7 image3)
   goals met: 7 of 14
19. (turn_to satellite3 star1 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star1)
   goals met: 7 of 14
20. (calibrate satellite3 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 7 of 14
21. (turn_to satellite3 phenomenon12 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon12)
   goals met: 7 of 14
22. (take_image satellite3 phenomenon12 instrument5 image1)
   added: (have_image phenomenon12 image1)
   goals met: 8 of 14
23. (turn_to satellite3 phenomenon15 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon15)
   goals met: 8 of 14
24. (take_image satellite3 phenomenon15 instrument5 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 9 of 14
25. (turn_to satellite3 star11 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 star11)
   goals met: 9 of 14
26. (take_image satellite3 star11 instrument5 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 10 of 14
27. (turn_to satellite3 star14 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star14)
   goals met: 10 of 14
28. (take_image satellite3 star14 instrument5 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 11 of 14
29. (turn_to satellite3 star16 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star16)
   goals met: 11 of 14
30. (take_image satellite3 star16 instrument5 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 12 of 14
31. (turn_to satellite3 star9 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star9)
   goals met: 12 of 14
32. (take_image satellite3 star9 instrument5 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 13 of 14
33. (turn_to satellite2 phenomenon15 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon15)
   goals met: 14 of 14
